# shell
brew 'zsh'
brew 'zsh-completions'
brew 'git'
# system
brew 'htop'
brew 'ncdu'
brew 'watch'
brew 'tmux'
brew 'ifstat'
# go
brew 'go'
brew 'glide'
brew 'mercurial'
# misc
brew 'jq'
brew 'wget'
brew 'node'
brew 'parallel'
brew 'the_silver_searcher'
# kubernetes
brew 'kubectl'
brew 'kubernetes-helm'
# other
brew 'taglib'

# desktop applications
tap 'caskroom/cask'

cask 'iterm2'
cask 'google-chrome'
cask 'atom'
cask 'sourcetree'
cask 'adobe-creative-cloud'
cask 'java'
cask 'flux'
cask 'alfred'
cask 'spectacle'
cask 'jetbrains-toolbox'
cask 'skype'
cask 'docker'
cask 'signal'
cask 'vlc'
