tap "homebrew/cask"
tap "homebrew/services"
tap "derailed/k9s"
tap "nats-io/nats-tools"

brew "ansible-lint"
brew "ansible"
brew "autopep8"
brew "bandit"
brew "black"
brew "commitizen"
brew "coreutils"
brew "k9s"
brew "dive"
brew "exiftool"
brew "flake8"
brew "flyctl"
brew "git-lfs"
brew "git"
brew "glow"
brew "gnu-getopt"
brew "go"
brew "graphviz"
brew "hadolint"
brew "htop"
brew "hyperfine"
brew "ifstat"
brew "iftop"
brew "ipcalc"
brew "ipv6calc"
brew "isort"
brew "jq"
brew "kind"
brew "leveldb"
brew "libfido2"
brew "libxml2"
brew "llvm"
brew "manifest-tool"
brew "mkcert"
brew "mosh"
brew "mypy"
brew "mysql"
brew "nats-io/nats-tools/nats"
brew "nats-server"
brew "ncdu"
brew "node"
brew "openssh"
brew "parallel"
brew "peco"
brew "pinentry-mac"
brew "pipx"
brew "poetry"
brew "postgresql@14"
brew "pre-commit"
brew "pyenv"
brew "rbenv-gemset"
brew "rbenv"
brew "ripgrep"
brew "ruff"
brew "shellcheck"
brew "sops"
brew "sqlite"
brew "telnet"
brew "terraform"
brew "tflint"
brew "tfsec"
brew "the_silver_searcher"
brew "tox"
brew "tree"
brew "vault"
brew "watch"
brew "wget"
brew "wireguard-tools"
brew "ykman"
brew "yubikey-personalization"
brew "zenith"
brew "zsh"

hostname = `hostname -s`.strip

if hostname =~ /^Cedriks-MacBook-Pro/
    tap "armmbed/formulae"

    brew "armmbed/formulae/arm-none-eabi-gcc"
    brew "gexiv2"
    brew "openocd"
    brew "qemu"
end

# King
if hostname =~ /^BARLTM/
    brew "astro"
    brew "atlantis"
    brew "bash"
    brew "dnsmasq"
    brew "drone-cli"
    brew "helm"
    brew "kubectx"
    brew "kubernetes-cli"
    brew "kustomize"
    brew "stern"
    brew "terraform-docs"
    brew "terragrunt"
    brew "velero"
end
