tap "homebrew/cask"
tap "homebrew/services"

brew "autopep8"
brew "black"
brew "commitizen"
brew "coreutils"
brew "exiftool"
brew "flake8"
brew "git"
brew "gnu-getopt"
brew "graphviz"
brew "hadolint"
brew "htop"
brew "ifstat"
brew "iftop"
brew "isort"
brew "jq"
brew "kind"
brew "leveldb"
brew "libfido2"
brew "libxml2"
brew "mkcert"
brew "mypy"
brew "mysql"
brew "ncdu"
brew "openssh"
brew "parallel"
brew "pinentry-mac"
brew "pipx"
brew "poetry"
brew "postgresql"
brew "pre-commit"
brew "pyenv"
brew "rbenv-gemset"
brew "rbenv"
brew "shellcheck"
brew "sops"
brew "sqlite"
brew "terraform"
brew "the_silver_searcher"
brew "tox"
brew "tree"
brew "vault"
brew "watch"
brew "wget"
brew "ykman"
brew "yubikey-personalization"
brew "zsh"

hostname = `hostname -s`.strip

# King
if hostname =~ /^BARLTM/
    tap "astronomer/tap"

    brew "astronomer/tap/astro@0.25.0"
    brew "atlantis"
    brew "dnsmasq"
    brew "drone-cli"
    brew "helm"
    brew "kubectx"
    brew "kubernetes-cli"
    brew "kustomize"
    brew "stern"
    brew "terraform-docs"
    brew "terragrunt"
    brew "tflint"
    brew "tfsec"
    brew "velero"
end
